#include <iostream>
#include <locale.h>
#include <stdlib.h>

using namespace std;

int main()
{
	setlocale(LC_ALL, "rus");
	cout << "--------------------------------------------------------Программа расчета скидок!----------------------------------------------------------------" << endl;
	float summa = 0.0F;
	cout << "Введите сумму покупки: "; cin >> summa;

	if (summa <= 0)
	{
		cout << "Некорректная сумма!" << endl;
	}
	else
	{
		if (summa >= 5000)
		{
			cout << "Ваша скидка 25%, это максимальная скидка! К оплате " << summa * 0.75 << " руб." << endl;
		}
		else
		{
			if (summa >= 4000)
			{
				cout << "Ваша скидка 20%, до скидки 25% не хватает " << 5000 - summa << " руб. К оплате: " << summa * 0.8 << " руб." << endl;
			}
			else
			{
				if (summa >= 3000)
				{
					cout << "Ваша скидка 15%, до скидки 20% не хватает " << 4000 - summa << " руб. К оплате: " << summa * 0.85 << " руб." << endl;
				}
				else
				{
					if (summa >= 2000)
					{
						cout << "Ваша скидка 10%, до скидки 15% не хватает " << 3000 - summa << " руб. К оплате: " << summa * 0.9 << " руб." << endl;
					}
					else
					{
						if (summa >= 1000)
						{
							cout << "Ваша скидка 5%, до скидки 10% не хватает " << 2000 - summa << " руб. К оплате: " << summa * 0.95 << " руб." << endl;
						}
						else
						{
							cout << "Ваша скидка 0%, до скидки 5% не хватает " << 1000 - summa << " руб. К оплате: " << summa << " руб." << endl;
						}
					}
				}
			}
		}
	}
	system("pause");
}